## SQL Connection Example

### Imports

In [2]:
import pandas as pd
from sqlalchemy import create_engine

---

### Create the connection to the database

In [3]:
postgres_connection_string = "postgres://{username}:{password}@{host}:{port}/{database}?gssencmode=disable".format(
    username="postgres",
    password="xxPASSWORDxx",
    host="localhost",
    port="5432",
    database="lahman_baseball"
)

In [4]:
print("Connection string is:", postgres_connection_string)

Connection string is: postgres://postgres:xxPASSWORDxx@localhost:5432/lahman_baseball?gssencmode=disable

Using the connection string, we can connect to the database by creating an engine. 
This has the ability to create a session to the db for us.

In [16]:
engine = create_engine(postgres_connection_string)

Next, we can start using it!
Create a SQL script, and let pandas run the query against the engine!

In [17]:
batting_sql = "SELECT * FROM batting;"

In [18]:
# use the connection to run a query using pandas!
batting_df = pd.read_sql(batting_sql, con=engine)
batting_df.head()

,playerid,yearid,stint,teamid,lgid,g,ab,r,h,h2b,...,rbi,sb,cs,bb,so,ibb,hbp,sh,sf,gidp
0,abercda01,1871,1,TRO,NA,1,4,0,0,0,...,0.0,0.0,0.0,0,0.0,NaN,NaN,NaN,NaN,NaN
1,addybo01,1871,1,RC1,NA,25,118,30,32,6,...,13.0,8.0,1.0,4,0.0,NaN,NaN,NaN,NaN,NaN
2,allisar01,1871,1,CL1,NA,29,137,28,40,4,...,19.0,3.0,1.0,2,5.0,NaN,NaN,NaN,NaN,NaN
3,allisdo01,1871,1,WS3,NA,27,133,28,44,10,...,27.0,1.0,1.0,0,2.0,NaN,NaN,NaN,NaN,NaN
4,ansonca01,1871,1,RC1,NA,25,120,29,39,11,...,16.0,6.0,2.0,2,1.0,NaN,NaN,NaN,NaN,NaN

---

### When you are finished using the connection.. Clean it up!

In [19]:
engine.dispose()